

# 					查看交换机的基本配置



1、交换机各种操作模式之间的切换

```cc
Switch>enable          //从用户模式进入特权模式
Switch#configure  terminal        //从特权模进入到全局配置模式
Switch(config)#interface fastEthernet 0/1     //进入接口配置模式
Switch(config-if)#exit              //退回上一级操作 模式
Switch(config)#
```

2、获得配置交换机帮助信息

```c
Switch>?           //显示当前模式下的所有可执行的命令
Exec commands:
  <1-99>      Session number to resume
  connect     Open a terminal connection
  disable     Turn off privileged commands
  disconnect  Disconnect an existing network connection
  enable      Turn on privileged commands
  exit        Exit from the EXEC
  logout      Exit from the EXEC
  ping        Send echo messages
  resume      Resume an active network connection
  show        Show running system information
  telnet      Open a telnet connection
  terminal    Set terminal line parameters
  traceroute  Trace route to destination
Switch>con?        //显示当前模式下以con开头的命令
connect  
```

```c
Switch(config)#interface ?    //显示interface 命令后可执行的参数
  Ethernet         IEEE 802.3
  FastEthernet     FastEthernet IEEE 802.3
  GigabitEthernet  GigabitEthernet IEEE 802.3z
  Port-channel     Ethernet Channel of interfaces
  Vlan             Catalyst Vlans
  range            interface range command
```

```c
Switch>en    //按住TAB键自动补齐缺省命令的单词
Switch>enable 
Switch#conf ter         //命令简写
Enter configuration commands, one per line.  End with CNTL/Z.             CTRL+Z 直接退到特权模式
Switch(config)#^Z
Switch#

```

3、查看交换机信息

3.1、查看交换机的版本信息

```c
Switch#show version    
Cisco Internetwork Operating System Software
IOS (tm) PT3000 Software (PT3000-I6Q4L2-M), Version 12.1(22)EA4, RELEASE SOFTWARE (fc1)     //版本信息
Copyright (c) 1986-2006 by cisco Systems, Inc.      //年
Compiled Fri 12-May-06 17:19 by pt_team       //月
Image text-base: 0x80010000, data-base: 0x80562000
```

3.2、查看交换机的端口信息

```c
Switch#show interface fastEthernet 0/1
FastEthernet0/1 is down, line protocol is down (disabled)     //端口号
  Hardware is Lance, address is 0060.4711.5d60 (bia 0060.4711.5d60)
 BW 100000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s        //端口模式     传输速率
```

3.3、查看交换机的MAC表

```c
Switch#show mac-address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----        

Switch#
```

3.4、查看交换机的管理中心（VLAN1）

```c
Switch#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------   //vlan 属性
1    default                          active    Fa0/1, Fa1/1, Fa2/1, Fa3/1
                                                Fa4/1, Fa5/1
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2    //vlan信息
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------
```

3.5、查看交换机的配置信息

```c
Switch#show running-config
Building configuration...

Current configuration : 452 bytes
!
version 12.1            //版本号
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch         //设备名称
!
!
spanning-tree mode pvst
!
interface FastEthernet0/1         //端口
!
interface FastEthernet1/1
```

