# 								配置交换机基本信息

1、进入交换机配置模式 

```c
Switch>enable           //进入特权模式
Switch#configure terminal         //进入全局模式
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
```

2、配置交换机名称

```c
Switch(config)#hostname S2926G      //修改设备名称
S2926G(config)#
```

3、配置交换机管理地址 

VLAN1默认是交换机管理中心，交换机 所有的接口都默认连接在VLAN1覆盖的广播域中。默认情况下，给VLAN11配置的 IP就是相当于给交换机配置管理地址

```c
S2926G(config)#interface vlan 1      //进入交换机管理接口配置模式
S2926G(config-if)#ip address 192.168.1.1 255.255.255.0       //配置交换机ip地址
S2926G(config-if)#no shutdown            //开启接口

S2926G(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

S2926G(config-if)#exit
S2926G(config)#
```

4、配置交换机的端口

交换机所有的端口默认情况 下  均开启。提示为Fastethernet  的接口默认情况下可以 选择为10M/100Mbit/s  自适应 端口速度，全双工模式也为自适应 （端口 速率、双工模式可配置 ）

```c
S2926G(config)#interface fastEthernet 0/1      //进入端口F0/1配置模式
S2926G(config-if)#speed 10					//配置端口速率 为10Mbit/s
S2926G(config-if)#duplex full				//配置 端口 双工模式为全双工
S2926G(config-if)#no  shutdown				//开启端口
S2926G(config-if)#
```

```c
S2926G(config-if)#description "This is a access port"     //配置端口描述信息 
S2926G(config-if)#exit
S2926G(config)#
```

```c
S2926G(config)#interface fastEthernet 0/1     //进入端口配置模式
S2926G(config-if)#no speed					//恢复端口 默认的带宽设置
S2926G(config-if)#no description			//取消端口描述信息
S2926G(config-if)#no duplex					//恢复端口默认 双工设置
S2926G(config-if)#end
```

```c
S2926G(config)#banner motd $     //设置交换机每日提示信息 
Enter TEXT message.  End with the character '$'.
welcom to$              //提示内容     以$结尾

S2926G(config)#exit
```

6、保存 交换机配置

```c
S2926G#copy running-config startup-config        //保存配置
Destination filename [startup-config]? y
S2926G#write								 //保存配置
Building configuration...
[OK]
S2926G#write memory								 //保存配置
Building configuration...
[OK]
S2926G#
```

7、查看交换机 配置信息

```c
S2926G#show interfaces    //查看交换机 接口信息
FastEthernet0/1 is down, line protocol is down (disabled)
  Hardware is Lance, address is 000a.4136.4901 (bia 000a.4136.4901)
 BW 10000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 10Mb/s
```

```c
S2926G#show interface  fastEthernet 0/1       //查看交换机接口Fa0/1信息 
FastEthernet0/1 is down, line protocol is down (disabled)
  Hardware is Lance, address is 000a.4136.4901 (bia 000a.4136.4901)
 BW 10000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 10Mb/s
```

```c
S2926G#show vlan							//查看管理VLAN1信息

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

 --More-- 
```

```c
S2926G#show running-config     						//查看系统配置信息
Building configuration...

Current configuration : 1009 bytes
!
version 12.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname S2926G
!
!
spanning-tree mode pvst
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
```

8、交换重载

```c
S2926G#reload             //重启
Proceed with reload? [confirm]
```

