# 									配置 交换机快速生成树协议

1、端口划分vlan

switch-2

```
Switch(config)#
Switch(config)#vlan 10    //创建vlan
Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/5      //进入pc子接口
Switch(config-if)#switchport access vlan 10   //配置端口模式。及绑定vlan
Switch(config-if)#no shutdown				//激活端口
Switch(config-if)#
```

switch-3

```
Switch#configure terminal
Switch(config)#hostname switch-3
switch-3(config)#vlan 10				//创建vlan
switch-3(config-vlan)#exit		
switch-3(config)#interface fastEthernet 0/5				//进入pc子接口
switch-3(config-if)#switchport access vlan 10				//配置端口模式。及绑定vlan
switch-3(config-if)#no shutdown						//激活端口
```

2、配置环路接口模式为trunk

Switch-2

```
Switch(config)#
Switch(config)#interface range fa0/1-2				//进入 端口模式
Switch(config-if-range)#switchport mode trunk			//配置 端口模式
Switch(config-if-range)#no shutdown
```

switch-3

```
switch-3(config)#interface range fa0/1-2							//进入端口模式
switch-3(config-if-range)#switchport trunk encapsulation dot1q			//配置trunk协议
switch-3(config-if-range)#switchport mode trunk						//配置端口模式
switch-3(config-if-range)#no shutdown
```

3、启用生成树协议    RSTP

switch-2

```
Switch(config)#spanning-tree mode rapid-pvst 
Switch(config)#
```

switch-3

```
Switch(config)#spanning-tree mode rapid-pvst 
Switch(config)#
```

4、查看生成树协议

```
Switch#show  spanning-tree 
```

5、测试

![image-20221113222341490](C:\Users\Administrator\AppData\Roaming\Typora\typora-user-images\image-20221113222341490.png)

6、生成树配置 常用命令

```
开启STP：switch（config）# spanning-tree vlan 1

设置RSTP：switch（config）# spanning-tree mode rapid-pvst

设置STP：switch（config）# spanning-tree mode pvst

关闭STP：switch（config）# no spanning-tree vlan 1

设置交换机优先级：switch（config）# spanning-tree vlan 1 priority +数字

指定根交换机：switch（config）# spanning-tree vlan 1 root primary

查看交换机生成树配置状态：switch # show spanning-tree 

查看交换机端口状态：switch # show spanning-tree interfaces fastEthernet 0/1

```

